tutorials/pimpleHFDIBFoam/Immersed_Cyl_Oscillating/ImmersedCyl-Sinusoidal-Re39-Mesh56320/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type    fixedValue;
        value   uniform (0 0 0);
    }

    right
    {
        type    fixedValue;
        value   uniform (0 0 0);
    }

    up
    {
      type    fixedValue;
       value   uniform (0 0 0);
       // type slip;
    }

    down
    {
       type    fixedValue;
      value   uniform (0 0 0);
      //type slip;
    }

    frontAndBack
    {
        type    empty;
    }
}

// ************************************************************************* //
